testCases/Attic/T3C1/kOmegaSSTLM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

y0 2.5000000000e-01;
y1 2.2054687500e-01;
y2 2.1519531250e-01;
y3 1.9343750000e-01;
y4 2.0828125000e-01;
y5 2.6273437500e-01; 

converToMeters 1.0;
vertices
(
    (-0.15 0 0)
    (0 0 0)
    (1.7 0 0)
    (-0.15 0 0.1)
    (0 0 0.1)
    (1.7 0 0.1) 
    (-0.15 0.3 0)
    (0 $y0 0)
    (1.7 $y5 0 )
    (-0.15 0.3 0.1)
    (0 $y0 0.1)
    (1.7 $y5 0.1)
);

blocks
(
    hex (0 1 7 6 3 4 10 9) (53 212 1) simpleGrading (0.1 100 1)
    hex (1 2 8 7 4 5 11 10) (318 212 1) simpleGrading (30 100 1)
);

edges
(
        BSpline 6 7 (
	    (-0.05 0.3  0.0)
	)
	spline 9 10 (
            (-0.05 0.3   0.1)
        )
        spline 7 8 (
            (0.175 $y1  0.0)
            (0.4   $y2  0.0)
            (0.750 $y3  0.0)
            (1.250 $y4  0.0)
	)
	spline 10 11(
            (0.175 $y1  0.1)
            (0.4   $y2  0.1)
            (0.750 $y3  0.1)
            (1.250 $y4  0.1)
	)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 9 6)
        );
    }
    lowerSymmetry
    {
        type slip;
        faces
        (
            (0 1 4 3)
        );
    }
    upperSymmetry
    {
        type slip;
        faces
        (
            (6 7 10 9)
            (7 8 11 10)
        );
    }
    flatPlate
    {
        type wall;
        faces
        (
            (1 2 5 4)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (2 5 11 8)
        );
    }
    
);


// ************************************************************************* //
